NXP-MCU-X-Lab/nxp_easy_mcuboot/Libraries/startup/inc/MKE15D7.h
/*
** ###################################################################
**     Compilers:           ARM Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    K15 Sub-Family Reference Manual Rev. 1, 9 Feb 2012
**     Version:             rev. 2.0, 2012-02-20
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MKE15D7
**
**     Copyright: 1997 - 2012 Freescale Semiconductor, Inc. All Rights Reserved.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2012-01-15)
**         Initial public version.
**     - rev. 2.0 (2012-02-20)
**         Update according to the Rev 1. reference manual.
**
** ###################################################################
*/

/**
 * @file MKE15D7.h
 * @version 2.0
 * @date 2012-02-20
 * @brief CMSIS Peripheral Access Layer for MKE15D7
 *
 * CMSIS Peripheral Access Layer for MKE15D7
 */

#if !defined(MKE15D7_H_)
#define MKE15D7_H_                               /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0200u
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000u

/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG(Reg,Bit) (*((uint32_t volatile*)(0x42000000u + (32u*((uint32_t)&(Reg) - (uint32_t)0x40000000u)) + (4u*((uint32_t)(Bit))))))

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
typedef enum IRQn {
  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M4 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M4 Usage Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M4 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M4 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M4 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M4 System Tick Interrupt */

  /* Device specific interrupts */
  DMA0_IRQn                    = 0,                /**< DMA Channel 0 Transfer Complete */
  DMA1_IRQn                    = 1,                /**< DMA Channel 1 Transfer Complete */
  DMA2_IRQn                    = 2,                /**< DMA Channel 2 Transfer Complete */
  DMA3_IRQn                    = 3,                /**< DMA Channel 3 Transfer Complete */
  DMA4_IRQn                    = 4,                /**< DMA Channel 4 Transfer Complete */
  DMA5_IRQn                    = 5,                /**< DMA Channel 5 Transfer Complete */
  DMA6_IRQn                    = 6,                /**< DMA Channel 6 Transfer Complete */
  DMA7_IRQn                    = 7,                /**< DMA Channel 7 Transfer Complete */
  DMA8_IRQn                    = 8,                /**< DMA Channel 8 Transfer Complete */
  DMA9_IRQn                    = 9,                /**< DMA Channel 9 Transfer Complete */
  DMA10_IRQn                   = 10,               /**< DMA Channel 10 Transfer Complete */
  DMA11_IRQn                   = 11,               /**< DMA Channel 11 Transfer Complete */
  DMA12_IRQn                   = 12,               /**< DMA Channel 12 Transfer Complete */
  DMA13_IRQn                   = 13,               /**< DMA Channel 13 Transfer Complete */
  iEVENT0_IRQn                 = 14,               /**< iEVENT channel 0 */
  iEVENT1_IRQn                 = 15,               /**< iEVENT channel 1 */
  DMA_Error_IRQn               = 16,               /**< DMA Error Interrupt */
  Reserved33_IRQn              = 17,               /**< Reserved interrupt 33 */
  FTMRA_IRQn                   = 18,               /**< FTMRA Interrupt */
  Read_Collision_IRQn          = 19,               /**< Read Collision */
  LVD_LVW_IRQn                 = 20,               /**< Low Voltage Detect, Low Voltage Warning */
  ICS_IRQn                     = 21,               /**< ICS */
  Watchdog_IRQn                = 22,               /**< WDOG */
  ADC0_IRQn                    = 23,               /**< ADC0 */
  ADC2_IRQn                    = 24,               /**< ADC2 */
  SPI0_IRQn                    = 25,               /**< SPI0 */
  SPI1_IRQn                    = 26,               /**< SPI1 */
  I2C0_IRQn                    = 27,               /**< IIC0 interrupt */
  I2C1_IRQn                    = 28,               /**< IIC1 interrupt */
  UART0_RX_TX_IRQn             = 29,               /**< UART0 status */
  UART0_ERR_IRQn               = 30,               /**< UART0 error */
  UART1_RX_TX_IRQn             = 31,               /**< UART1 status */
  UART1_ERR_IRQn               = 32,               /**< UART1 error */
  UART2_RX_TX_IRQn             = 33,               /**< UART2 status */
  UART2_ERR_IRQn               = 34,               /**< UART2 error */
  UART3_RX_TX_IRQn             = 35,               /**< UART3 status */
  UART3_ERR_IRQn               = 36,               /**< UART3 error */
  ADC1_IRQn                    = 37,               /**< ADC1 */
  ADC3_IRQn                    = 38,               /**< ADC3 */
  SWI_IRQn                     = 39,               /**< Software interrupt */
  CMP0_IRQn                    = 40,               /**< CMP0 */
  CMP1_IRQn                    = 41,               /**< CMP1 */
  CMP2_IRQn                    = 42,               /**< CMP2 */
  CMP3_IRQn                    = 43,               /**< CMP3 */
  FTM0_IRQn                    = 44,               /**< FTM0 */
  FTM1_IRQn                    = 45,               /**< FTM1 */
  FTM2_IRQn                    = 46,               /**< FTM2 */
  FTM3_IRQn                    = 47,               /**< FTM3 */
  CMT_IRQn                     = 48,               /**< CMT */
  PDB0_IRQn                    = 49,               /**< PDB0 */
  PDB1_IRQn                    = 50,               /**< PDB1 */
  PDB2_IRQn                    = 51,               /**< PDB2 */
  PDB3_IRQn                    = 52,               /**< PDB3 */
  PIT0_IRQn                    = 53,               /**< PIT channel 0 */
  PIT1_IRQn                    = 54,               /**< PIT channel 1 */
  PIT2_IRQn                    = 55,               /**< PIT channel 2 */
  PIT3_IRQn                    = 56,               /**< PIT channel 3 */
  RTC_IRQn                     = 57,               /**< RTC */
  TSI0_IRQn                    = 58,               /**< TSI0 */
  PORTA_IRQn                   = 59,               /**< Port A interrupt */
  PORTB_IRQn                   = 60,               /**< Port B interrupt */
  PORTC_IRQn                   = 61,               /**< Port C interrupt */
  PORTD_IRQn                   = 62,               /**< Port D interrupt */
  PORTE_IRQn                   = 63                /**< Port E interrupt */
} IRQn_Type;

/**
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M4 Core Configuration
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Cortex_Core_Configuration Cortex M4 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */

#include "core_cm4.h"                  /* Core Peripheral Access Layer */
#include "system_MKE15D7.h"            /* Device specific configuration file */

/**
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


