NXP-MCU-X-Lab/nxp_easy_mcuboot/Libraries/startup/inc/MKE15D7.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma push
  #pragma anon_unions
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 * @{
 */

/** ADC - Register Layout Typedef */
typedef struct {
  __IO uint16_t SC1;                               /**< Status and Control Register 1, offset: 0x0 */
  __IO uint16_t SC2;                               /**< Status and Control Register 2, offset: 0x2 */
  __IO uint16_t SC3;                               /**< Status and Control Register 3, offset: 0x4 */
  __IO uint16_t SC4;                               /**< Status and Control Register 4, offset: 0x6 */
  __I  uint16_t R;                                 /**< Conversion Result Register, offset: 0x8 */
  __IO uint16_t CVA;                               /**< Compare Value Register A, offset: 0xA */
  __IO uint16_t CVB;                               /**< Compare Value Register B, offset: 0xC */
  __IO uint16_t APCTL;                             /**< Pin Control Register, offset: 0xE */
} ADC_Type;

/* ----------------------------------------------------------------------------
   -- ADC Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup ADC_Register_Masks ADC Register Masks
 * @{
 */

/* SC1 Bit Fields */
#define ADC_SC1_ADCH_MASK                        0x1Fu
#define ADC_SC1_ADCH_SHIFT                       0
#define ADC_SC1_ADCH(x)                          (((uint16_t)(((uint16_t)(x))<<ADC_SC1_ADCH_SHIFT))&ADC_SC1_ADCH_MASK)
#define ADC_SC1_ADCO_MASK                        0x20u
#define ADC_SC1_ADCO_SHIFT                       5
#define ADC_SC1_AIEN_MASK                        0x40u
#define ADC_SC1_AIEN_SHIFT                       6
#define ADC_SC1_COCO_MASK                        0x80u
#define ADC_SC1_COCO_SHIFT                       7
/* SC2 Bit Fields */
#define ADC_SC2_FFULL_MASK                       0x4u
#define ADC_SC2_FFULL_SHIFT                      2
#define ADC_SC2_FEMPTY_MASK                      0x8u
#define ADC_SC2_FEMPTY_SHIFT                     3
#define ADC_SC2_ACDSEL_MASK                      0x10u
#define ADC_SC2_ACDSEL_SHIFT                     4
#define ADC_SC2_ACFE_MASK                        0x20u
#define ADC_SC2_ACFE_SHIFT                       5
#define ADC_SC2_ADTRG_MASK                       0x40u
#define ADC_SC2_ADTRG_SHIFT                      6
#define ADC_SC2_ADACT_MASK                       0x80u
#define ADC_SC2_ADACT_SHIFT                      7
/* SC3 Bit Fields */
#define ADC_SC3_ADICLK_MASK                      0x3u
#define ADC_SC3_ADICLK_SHIFT                     0
#define ADC_SC3_ADICLK(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_SC3_ADICLK_SHIFT))&ADC_SC3_ADICLK_MASK)
#define ADC_SC3_MODE_MASK                        0xCu
#define ADC_SC3_MODE_SHIFT                       2
#define ADC_SC3_MODE(x)                          (((uint16_t)(((uint16_t)(x))<<ADC_SC3_MODE_SHIFT))&ADC_SC3_MODE_MASK)
#define ADC_SC3_ADLSMP_MASK                      0x10u
#define ADC_SC3_ADLSMP_SHIFT                     4
#define ADC_SC3_ADIV_MASK                        0x60u
#define ADC_SC3_ADIV_SHIFT                       5
#define ADC_SC3_ADIV(x)                          (((uint16_t)(((uint16_t)(x))<<ADC_SC3_ADIV_SHIFT))&ADC_SC3_ADIV_MASK)
#define ADC_SC3_ADLPC_MASK                       0x80u
#define ADC_SC3_ADLPC_SHIFT                      7
/* SC4 Bit Fields */
#define ADC_SC4_AFDEP_MASK                       0x7u
#define ADC_SC4_AFDEP_SHIFT                      0
#define ADC_SC4_AFDEP(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_SC4_AFDEP_SHIFT))&ADC_SC4_AFDEP_MASK)
#define ADC_SC4_ACFSEL_MASK                      0x20u
#define ADC_SC4_ACFSEL_SHIFT                     5
#define ADC_SC4_ASCANE_MASK                      0x40u
#define ADC_SC4_ASCANE_SHIFT                     6
#define ADC_SC4_DMAEN_MASK                       0x80u
#define ADC_SC4_DMAEN_SHIFT                      7
/* R Bit Fields */
#define ADC_R_ADR_MASK                           0xFFFFu
#define ADC_R_ADR_SHIFT                          0
#define ADC_R_ADR(x)                             (((uint16_t)(((uint16_t)(x))<<ADC_R_ADR_SHIFT))&ADC_R_ADR_MASK)
/* CVA Bit Fields */
#define ADC_CVA_VA_MASK                          0xFFFFu
#define ADC_CVA_VA_SHIFT                         0
#define ADC_CVA_VA(x)                            (((uint16_t)(((uint16_t)(x))<<ADC_CVA_VA_SHIFT))&ADC_CVA_VA_MASK)
/* CVB Bit Fields */
#define ADC_CVB_VB_MASK                          0xFFFFu
#define ADC_CVB_VB_SHIFT                         0
#define ADC_CVB_VB(x)                            (((uint16_t)(((uint16_t)(x))<<ADC_CVB_VB_SHIFT))&ADC_CVB_VB_MASK)
/* APCTL Bit Fields */
#define ADC_APCTL_ADPC0_MASK                     0x1u
#define ADC_APCTL_ADPC0_SHIFT                    0
#define ADC_APCTL_ADPC1_MASK                     0x2u
#define ADC_APCTL_ADPC1_SHIFT                    1
#define ADC_APCTL_ADPC2_MASK                     0x4u
#define ADC_APCTL_ADPC2_SHIFT                    2
#define ADC_APCTL_ADPC3_MASK                     0x8u
#define ADC_APCTL_ADPC3_SHIFT                    3
#define ADC_APCTL_ADPC4_MASK                     0x10u
#define ADC_APCTL_ADPC4_SHIFT                    4
#define ADC_APCTL_ADPC5_MASK                     0x20u
#define ADC_APCTL_ADPC5_SHIFT                    5
#define ADC_APCTL_ADPC6_MASK                     0x40u
#define ADC_APCTL_ADPC6_SHIFT                    6
#define ADC_APCTL_ADPC7_MASK                     0x80u
#define ADC_APCTL_ADPC7_SHIFT                    7
#define ADC_APCTL_ADPC8_MASK                     0x100u
#define ADC_APCTL_ADPC8_SHIFT                    8
#define ADC_APCTL_ADPC9_MASK                     0x200u
#define ADC_APCTL_ADPC9_SHIFT                    9
#define ADC_APCTL_ADPC10_MASK                    0x400u
#define ADC_APCTL_ADPC10_SHIFT                   10
#define ADC_APCTL_ADPC11_MASK                    0x800u
#define ADC_APCTL_ADPC11_SHIFT                   11

/**
 * @}
 */ /* end of group ADC_Register_Masks */


/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define ADC0_BASE                                (0x4003B000u)
/** Peripheral ADC0 base pointer */
#define ADC0                                     ((ADC_Type *)ADC0_BASE)
/** Peripheral ADC1 base address */
#define ADC1_BASE                                (0x4003C000u)
/** Peripheral ADC1 base pointer */
#define ADC1                                     ((ADC_Type *)ADC1_BASE)
/** Peripheral ADC2 base address */
#define ADC2_BASE                                (0x4003D000u)
/** Peripheral ADC2 base pointer */
#define ADC2                                     ((ADC_Type *)ADC2_BASE)
/** Peripheral ADC3 base address */
#define ADC3_BASE                                (0x4003E000u)
/** Peripheral ADC3 base pointer */
#define ADC3                                     ((ADC_Type *)ADC3_BASE)

/**
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- AIPS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup AIPS_Peripheral_Access_Layer AIPS Peripheral Access Layer
 * @{
 */

