NXP-MCU-X-Lab/nxp_easy_mcuboot/Libraries/startup/inc/MKE15D7.h
/** FTMRA - Register Layout Typedef */
typedef struct {
  __I  uint8_t FSEC;                               /**< Flash Security Register, offset: 0x0 */
  __IO uint8_t FCLKDIV;                            /**< Flash Clock Divider Register, offset: 0x1 */
  __IO uint8_t FECCRIX;                            /**< Flash ECCR Index Register, offset: 0x2 */
  __IO uint8_t FCCOBIX;                            /**< Flash Common Command Object Index Register, offset: 0x3 */
  __IO uint8_t FERCNFG;                            /**< Flash Error Configuration Register, offset: 0x4 */
  __IO uint8_t FCNFG;                              /**< Flash Configuration Register, offset: 0x5 */
  __IO uint8_t FERSTAT;                            /**< Flash Error Status Register, offset: 0x6 */
  __IO uint8_t FSTAT;                              /**< Flash Status Register, offset: 0x7 */
  __IO uint8_t DFPROT;                             /**< D-Flash Protection Register, offset: 0x8 */
  __IO uint8_t FPROT;                              /**< P-Flash Protection Register, offset: 0x9 */
  __IO uint8_t FCCOBLO;                            /**< Flash Common Command Object Low Register, offset: 0xA */
  __IO uint8_t FCCOBHI;                            /**< Flash Common Command Object High Register, offset: 0xB */
       uint8_t RESERVED_0[2];
  __I  uint8_t FECCRLO;                            /**< Flash ECC Error Results Low Register, offset: 0xE */
  __I  uint8_t FECCRHI;                            /**< Flash ECC Error Results High Register, offset: 0xF */
       uint8_t RESERVED_1[1];
  __I  uint8_t FOPT;                               /**< Flash Option Register, offset: 0x11 */
} FTMRA_Type;

/* ----------------------------------------------------------------------------
   -- FTMRA Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup FTMRA_Register_Masks FTMRA Register Masks
 * @{
 */

/* FSEC Bit Fields */
#define FTMRA_FSEC_SEC_MASK                      0x3u
#define FTMRA_FSEC_SEC_SHIFT                     0
#define FTMRA_FSEC_SEC(x)                        (((uint8_t)(((uint8_t)(x))<<FTMRA_FSEC_SEC_SHIFT))&FTMRA_FSEC_SEC_MASK)
#define FTMRA_FSEC_RNV_MASK                      0x3Cu
#define FTMRA_FSEC_RNV_SHIFT                     2
#define FTMRA_FSEC_RNV(x)                        (((uint8_t)(((uint8_t)(x))<<FTMRA_FSEC_RNV_SHIFT))&FTMRA_FSEC_RNV_MASK)
#define FTMRA_FSEC_KEYEN_MASK                    0xC0u
#define FTMRA_FSEC_KEYEN_SHIFT                   6
#define FTMRA_FSEC_KEYEN(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_FSEC_KEYEN_SHIFT))&FTMRA_FSEC_KEYEN_MASK)
/* FCLKDIV Bit Fields */
#define FTMRA_FCLKDIV_FDIV_MASK                  0x7Fu
#define FTMRA_FCLKDIV_FDIV_SHIFT                 0
#define FTMRA_FCLKDIV_FDIV(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FCLKDIV_FDIV_SHIFT))&FTMRA_FCLKDIV_FDIV_MASK)
#define FTMRA_FCLKDIV_FDIVLD_MASK                0x80u
#define FTMRA_FCLKDIV_FDIVLD_SHIFT               7
/* FECCRIX Bit Fields */
#define FTMRA_FECCRIX_ECCRIX_MASK                0x7u
#define FTMRA_FECCRIX_ECCRIX_SHIFT               0
#define FTMRA_FECCRIX_ECCRIX(x)                  (((uint8_t)(((uint8_t)(x))<<FTMRA_FECCRIX_ECCRIX_SHIFT))&FTMRA_FECCRIX_ECCRIX_MASK)
/* FCCOBIX Bit Fields */
#define FTMRA_FCCOBIX_CCOBIX_MASK                0x7u
#define FTMRA_FCCOBIX_CCOBIX_SHIFT               0
#define FTMRA_FCCOBIX_CCOBIX(x)                  (((uint8_t)(((uint8_t)(x))<<FTMRA_FCCOBIX_CCOBIX_SHIFT))&FTMRA_FCCOBIX_CCOBIX_MASK)
/* FERCNFG Bit Fields */
#define FTMRA_FERCNFG_SFDIE_MASK                 0x1u
#define FTMRA_FERCNFG_SFDIE_SHIFT                0
#define FTMRA_FERCNFG_DFDIE_MASK                 0x2u
#define FTMRA_FERCNFG_DFDIE_SHIFT                1
/* FCNFG Bit Fields */
#define FTMRA_FCNFG_FSFD_MASK                    0x1u
#define FTMRA_FCNFG_FSFD_SHIFT                   0
#define FTMRA_FCNFG_FDFD_MASK                    0x2u
#define FTMRA_FCNFG_FDFD_SHIFT                   1
#define FTMRA_FCNFG_IGNSF_MASK                   0x10u
#define FTMRA_FCNFG_IGNSF_SHIFT                  4
#define FTMRA_FCNFG_ERSAREQ_MASK                 0x20u
#define FTMRA_FCNFG_ERSAREQ_SHIFT                5
#define FTMRA_FCNFG_CCIE_MASK                    0x80u
#define FTMRA_FCNFG_CCIE_SHIFT                   7
/* FERSTAT Bit Fields */
#define FTMRA_FERSTAT_SFDIF_MASK                 0x1u
#define FTMRA_FERSTAT_SFDIF_SHIFT                0
#define FTMRA_FERSTAT_DFDIF_MASK                 0x2u
#define FTMRA_FERSTAT_DFDIF_SHIFT                1
/* FSTAT Bit Fields */
#define FTMRA_FSTAT_MGSTAT_MASK                  0x3u
#define FTMRA_FSTAT_MGSTAT_SHIFT                 0
#define FTMRA_FSTAT_MGSTAT(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FSTAT_MGSTAT_SHIFT))&FTMRA_FSTAT_MGSTAT_MASK)
#define FTMRA_FSTAT_MGBUSY_MASK                  0x8u
#define FTMRA_FSTAT_MGBUSY_SHIFT                 3
#define FTMRA_FSTAT_FPVIOL_MASK                  0x10u
#define FTMRA_FSTAT_FPVIOL_SHIFT                 4
#define FTMRA_FSTAT_ACCERR_MASK                  0x20u
#define FTMRA_FSTAT_ACCERR_SHIFT                 5
#define FTMRA_FSTAT_CCIF_MASK                    0x80u
#define FTMRA_FSTAT_CCIF_SHIFT                   7
/* DFPROT Bit Fields */
#define FTMRA_DFPROT_DPS_MASK                    0x1Fu
#define FTMRA_DFPROT_DPS_SHIFT                   0
#define FTMRA_DFPROT_DPS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_DFPROT_DPS_SHIFT))&FTMRA_DFPROT_DPS_MASK)
#define FTMRA_DFPROT_DPOPEN_MASK                 0x80u
#define FTMRA_DFPROT_DPOPEN_SHIFT                7
/* FPROT Bit Fields */
#define FTMRA_FPROT_FPLS_MASK                    0x3u
#define FTMRA_FPROT_FPLS_SHIFT                   0
#define FTMRA_FPROT_FPLS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_FPROT_FPLS_SHIFT))&FTMRA_FPROT_FPLS_MASK)
#define FTMRA_FPROT_FPLDIS_MASK                  0x4u
#define FTMRA_FPROT_FPLDIS_SHIFT                 2
#define FTMRA_FPROT_FPHS_MASK                    0x18u
#define FTMRA_FPROT_FPHS_SHIFT                   3
#define FTMRA_FPROT_FPHS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_FPROT_FPHS_SHIFT))&FTMRA_FPROT_FPHS_MASK)
#define FTMRA_FPROT_FPHDIS_MASK                  0x20u
#define FTMRA_FPROT_FPHDIS_SHIFT                 5
#define FTMRA_FPROT_RNV_MASK                     0x40u
#define FTMRA_FPROT_RNV_SHIFT                    6
#define FTMRA_FPROT_FPOPEN_MASK                  0x80u
#define FTMRA_FPROT_FPOPEN_SHIFT                 7
/* FCCOBLO Bit Fields */
#define FTMRA_FCCOBLO_CCOBn_MASK                 0xFFu
#define FTMRA_FCCOBLO_CCOBn_SHIFT                0
#define FTMRA_FCCOBLO_CCOBn(x)                   (((uint8_t)(((uint8_t)(x))<<FTMRA_FCCOBLO_CCOBn_SHIFT))&FTMRA_FCCOBLO_CCOBn_MASK)
/* FCCOBHI Bit Fields */
#define FTMRA_FCCOBHI_CCOBn_MASK                 0xFFu
#define FTMRA_FCCOBHI_CCOBn_SHIFT                0
#define FTMRA_FCCOBHI_CCOBn(x)                   (((uint8_t)(((uint8_t)(x))<<FTMRA_FCCOBHI_CCOBn_SHIFT))&FTMRA_FCCOBHI_CCOBn_MASK)
/* FECCRLO Bit Fields */
#define FTMRA_FECCRLO_ECCR_MASK                  0xFFu
#define FTMRA_FECCRLO_ECCR_SHIFT                 0
#define FTMRA_FECCRLO_ECCR(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FECCRLO_ECCR_SHIFT))&FTMRA_FECCRLO_ECCR_MASK)
/* FECCRHI Bit Fields */
#define FTMRA_FECCRHI_ECCR_MASK                  0xFFu
#define FTMRA_FECCRHI_ECCR_SHIFT                 0
#define FTMRA_FECCRHI_ECCR(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FECCRHI_ECCR_SHIFT))&FTMRA_FECCRHI_ECCR_MASK)
/* FOPT Bit Fields */
#define FTMRA_FOPT_NV_MASK                       0xFFu
#define FTMRA_FOPT_NV_SHIFT                      0
#define FTMRA_FOPT_NV(x)                         (((uint8_t)(((uint8_t)(x))<<FTMRA_FOPT_NV_SHIFT))&FTMRA_FOPT_NV_MASK)

/**
 * @}
 */ /* end of group FTMRA_Register_Masks */


/* FTMRA - Peripheral instance base addresses */
/** Peripheral FTMRA base address */
#define FTMRA_BASE                               (0x40039000u)
/** Peripheral FTMRA base pointer */
#define FTMRA                                    ((FTMRA_Type *)FTMRA_BASE)

/**
 * @}
 */ /* end of group FTMRA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- GPIO Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup GPIO_Peripheral_Access_Layer GPIO Peripheral Access Layer
 * @{
 */

/** GPIO - Register Layout Typedef */
typedef struct {
  __IO uint32_t PDOR;                              /**< Port Data Output Register, offset: 0x0 */
  __O  uint32_t PSOR;                              /**< Port Set Output Register, offset: 0x4 */
  __O  uint32_t PCOR;                              /**< Port Clear Output Register, offset: 0x8 */
  __O  uint32_t PTOR;                              /**< Port Toggle Output Register, offset: 0xC */
  __I  uint32_t PDIR;                              /**< Port Data Input Register, offset: 0x10 */
  __IO uint32_t PDDR;                              /**< Port Data Direction Register, offset: 0x14 */
} GPIO_Type;

/* ----------------------------------------------------------------------------
   -- GPIO Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup GPIO_Register_Masks GPIO Register Masks
 * @{
 */

