NXP-MCU-X-Lab/nxp_easy_mcuboot/Libraries/startup/inc/MKE15D7.h
/* DRL Bit Fields */
#define IEVENT_DRL_IN_A0_MASK                    0x1u
#define IEVENT_DRL_IN_A0_SHIFT                   0
#define IEVENT_DRL_IN_B0_MASK                    0x2u
#define IEVENT_DRL_IN_B0_SHIFT                   1
#define IEVENT_DRL_IN_C0_MASK                    0x4u
#define IEVENT_DRL_IN_C0_SHIFT                   2
#define IEVENT_DRL_IN_D0_MASK                    0x8u
#define IEVENT_DRL_IN_D0_SHIFT                   3
#define IEVENT_DRL_Output_FSM0_MASK              0x70u
#define IEVENT_DRL_Output_FSM0_SHIFT             4
#define IEVENT_DRL_Output_FSM0(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM0_SHIFT))&IEVENT_DRL_Output_FSM0_MASK)
#define IEVENT_DRL_Ev_Out0_MASK                  0x80u
#define IEVENT_DRL_Ev_Out0_SHIFT                 7
#define IEVENT_DRL_IN_A1_MASK                    0x100u
#define IEVENT_DRL_IN_A1_SHIFT                   8
#define IEVENT_DRL_IN_B1_MASK                    0x200u
#define IEVENT_DRL_IN_B1_SHIFT                   9
#define IEVENT_DRL_IN_C1_MASK                    0x400u
#define IEVENT_DRL_IN_C1_SHIFT                   10
#define IEVENT_DRL_IN_D1_MASK                    0x800u
#define IEVENT_DRL_IN_D1_SHIFT                   11
#define IEVENT_DRL_Output_FSM1_MASK              0x7000u
#define IEVENT_DRL_Output_FSM1_SHIFT             12
#define IEVENT_DRL_Output_FSM1(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM1_SHIFT))&IEVENT_DRL_Output_FSM1_MASK)
#define IEVENT_DRL_Ev_Out1_MASK                  0x8000u
#define IEVENT_DRL_Ev_Out1_SHIFT                 15
#define IEVENT_DRL_IN_A2_MASK                    0x10000u
#define IEVENT_DRL_IN_A2_SHIFT                   16
#define IEVENT_DRL_IN_B2_MASK                    0x20000u
#define IEVENT_DRL_IN_B2_SHIFT                   17
#define IEVENT_DRL_IN_C2_MASK                    0x40000u
#define IEVENT_DRL_IN_C2_SHIFT                   18
#define IEVENT_DRL_IN_D2_MASK                    0x80000u
#define IEVENT_DRL_IN_D2_SHIFT                   19
#define IEVENT_DRL_Output_FSM2_MASK              0x700000u
#define IEVENT_DRL_Output_FSM2_SHIFT             20
#define IEVENT_DRL_Output_FSM2(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM2_SHIFT))&IEVENT_DRL_Output_FSM2_MASK)
#define IEVENT_DRL_Ev_Out2_MASK                  0x800000u
#define IEVENT_DRL_Ev_Out2_SHIFT                 23
#define IEVENT_DRL_IN_A3_MASK                    0x1000000u
#define IEVENT_DRL_IN_A3_SHIFT                   24
#define IEVENT_DRL_IN_B3_MASK                    0x2000000u
#define IEVENT_DRL_IN_B3_SHIFT                   25
#define IEVENT_DRL_IN_C3_MASK                    0x4000000u
#define IEVENT_DRL_IN_C3_SHIFT                   26
#define IEVENT_DRL_IN_D3_MASK                    0x8000000u
#define IEVENT_DRL_IN_D3_SHIFT                   27
#define IEVENT_DRL_Output_FSM3_MASK              0x70000000u
#define IEVENT_DRL_Output_FSM3_SHIFT             28
#define IEVENT_DRL_Output_FSM3(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM3_SHIFT))&IEVENT_DRL_Output_FSM3_MASK)
#define IEVENT_DRL_Ev_Out3_MASK                  0x80000000u
#define IEVENT_DRL_Ev_Out3_SHIFT                 31
/* CRL Bit Fields */
#define IEVENT_CRL_Type0_MASK                    0x3u
#define IEVENT_CRL_Type0_SHIFT                   0
#define IEVENT_CRL_Type0(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type0_SHIFT))&IEVENT_CRL_Type0_MASK)
#define IEVENT_CRL_OSE0_MASK                     0x4u
#define IEVENT_CRL_OSE0_SHIFT                    2
#define IEVENT_CRL_DDB0_MASK                     0x8u
#define IEVENT_CRL_DDB0_SHIFT                    3
#define IEVENT_CRL_RO0_MASK                      0x80u
#define IEVENT_CRL_RO0_SHIFT                     7
#define IEVENT_CRL_Type1_MASK                    0x300u
#define IEVENT_CRL_Type1_SHIFT                   8
#define IEVENT_CRL_Type1(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type1_SHIFT))&IEVENT_CRL_Type1_MASK)
#define IEVENT_CRL_OSE1_MASK                     0x400u
#define IEVENT_CRL_OSE1_SHIFT                    10
#define IEVENT_CRL_DDB1_MASK                     0x800u
#define IEVENT_CRL_DDB1_SHIFT                    11
#define IEVENT_CRL_RO1_MASK                      0x8000u
#define IEVENT_CRL_RO1_SHIFT                     15
#define IEVENT_CRL_Type2_MASK                    0x30000u
#define IEVENT_CRL_Type2_SHIFT                   16
#define IEVENT_CRL_Type2(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type2_SHIFT))&IEVENT_CRL_Type2_MASK)
#define IEVENT_CRL_OSE2_MASK                     0x40000u
#define IEVENT_CRL_OSE2_SHIFT                    18
#define IEVENT_CRL_DDB2_MASK                     0x80000u
#define IEVENT_CRL_DDB2_SHIFT                    19
#define IEVENT_CRL_RO2_MASK                      0x800000u
#define IEVENT_CRL_RO2_SHIFT                     23
#define IEVENT_CRL_Type3_MASK                    0x3000000u
#define IEVENT_CRL_Type3_SHIFT                   24
#define IEVENT_CRL_Type3(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type3_SHIFT))&IEVENT_CRL_Type3_MASK)
#define IEVENT_CRL_OSE3_MASK                     0x4000000u
#define IEVENT_CRL_OSE3_SHIFT                    26
#define IEVENT_CRL_DDB3_MASK                     0x8000000u
#define IEVENT_CRL_DDB3_SHIFT                    27
#define IEVENT_CRL_RO3_MASK                      0x80000000u
#define IEVENT_CRL_RO3_SHIFT                     31
/* IMXCR Bit Fields */
#define IEVENT_IMXCR_D_Select_MASK               0xFu
#define IEVENT_IMXCR_D_Select_SHIFT              0
#define IEVENT_IMXCR_D_Select(x)                 (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR_D_Select_SHIFT))&IEVENT_IMXCR_D_Select_MASK)
#define IEVENT_IMXCR_C_Select_MASK               0xF00u
#define IEVENT_IMXCR_C_Select_SHIFT              8
#define IEVENT_IMXCR_C_Select(x)                 (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR_C_Select_SHIFT))&IEVENT_IMXCR_C_Select_MASK)
#define IEVENT_IMXCR_B_Select_MASK               0xF0000u
#define IEVENT_IMXCR_B_Select_SHIFT              16
#define IEVENT_IMXCR_B_Select(x)                 (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR_B_Select_SHIFT))&IEVENT_IMXCR_B_Select_MASK)
#define IEVENT_IMXCR_A_Select_MASK               0xF000000u
#define IEVENT_IMXCR_A_Select_SHIFT              24
#define IEVENT_IMXCR_A_Select(x)                 (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR_A_Select_SHIFT))&IEVENT_IMXCR_A_Select_MASK)
/* BFECR Bit Fields */
#define IEVENT_BFECR_PT3_DC_MASK                 0x3u
#define IEVENT_BFECR_PT3_DC_SHIFT                0
#define IEVENT_BFECR_PT3_DC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT3_DC_SHIFT))&IEVENT_BFECR_PT3_DC_MASK)
#define IEVENT_BFECR_PT3_CC_MASK                 0xCu
#define IEVENT_BFECR_PT3_CC_SHIFT                2
#define IEVENT_BFECR_PT3_CC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT3_CC_SHIFT))&IEVENT_BFECR_PT3_CC_MASK)
#define IEVENT_BFECR_PT3_BC_MASK                 0x30u
#define IEVENT_BFECR_PT3_BC_SHIFT                4
#define IEVENT_BFECR_PT3_BC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT3_BC_SHIFT))&IEVENT_BFECR_PT3_BC_MASK)
#define IEVENT_BFECR_PT3_AC_MASK                 0xC0u
#define IEVENT_BFECR_PT3_AC_SHIFT                6
#define IEVENT_BFECR_PT3_AC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT3_AC_SHIFT))&IEVENT_BFECR_PT3_AC_MASK)
#define IEVENT_BFECR_PT2_DC_MASK                 0x300u
#define IEVENT_BFECR_PT2_DC_SHIFT                8
#define IEVENT_BFECR_PT2_DC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT2_DC_SHIFT))&IEVENT_BFECR_PT2_DC_MASK)
#define IEVENT_BFECR_PT2_CC_MASK                 0xC00u
#define IEVENT_BFECR_PT2_CC_SHIFT                10
#define IEVENT_BFECR_PT2_CC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT2_CC_SHIFT))&IEVENT_BFECR_PT2_CC_MASK)
#define IEVENT_BFECR_PT2_BC_MASK                 0x3000u
#define IEVENT_BFECR_PT2_BC_SHIFT                12
#define IEVENT_BFECR_PT2_BC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT2_BC_SHIFT))&IEVENT_BFECR_PT2_BC_MASK)
#define IEVENT_BFECR_PT2_AC_MASK                 0xC000u
#define IEVENT_BFECR_PT2_AC_SHIFT                14
#define IEVENT_BFECR_PT2_AC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT2_AC_SHIFT))&IEVENT_BFECR_PT2_AC_MASK)
#define IEVENT_BFECR_PT1_DC_MASK                 0x30000u
#define IEVENT_BFECR_PT1_DC_SHIFT                16
#define IEVENT_BFECR_PT1_DC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT1_DC_SHIFT))&IEVENT_BFECR_PT1_DC_MASK)
#define IEVENT_BFECR_PT1_CC_MASK                 0xC0000u
#define IEVENT_BFECR_PT1_CC_SHIFT                18
#define IEVENT_BFECR_PT1_CC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT1_CC_SHIFT))&IEVENT_BFECR_PT1_CC_MASK)
#define IEVENT_BFECR_PT1_BC_MASK                 0x300000u
#define IEVENT_BFECR_PT1_BC_SHIFT                20
#define IEVENT_BFECR_PT1_BC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT1_BC_SHIFT))&IEVENT_BFECR_PT1_BC_MASK)
#define IEVENT_BFECR_PT1_AC_MASK                 0xC00000u
#define IEVENT_BFECR_PT1_AC_SHIFT                22
#define IEVENT_BFECR_PT1_AC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT1_AC_SHIFT))&IEVENT_BFECR_PT1_AC_MASK)
#define IEVENT_BFECR_PT0_DC_MASK                 0x3000000u
#define IEVENT_BFECR_PT0_DC_SHIFT                24
#define IEVENT_BFECR_PT0_DC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT0_DC_SHIFT))&IEVENT_BFECR_PT0_DC_MASK)
#define IEVENT_BFECR_PT0_CC_MASK                 0xC000000u
#define IEVENT_BFECR_PT0_CC_SHIFT                26
#define IEVENT_BFECR_PT0_CC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT0_CC_SHIFT))&IEVENT_BFECR_PT0_CC_MASK)
#define IEVENT_BFECR_PT0_BC_MASK                 0x30000000u
#define IEVENT_BFECR_PT0_BC_SHIFT                28
#define IEVENT_BFECR_PT0_BC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT0_BC_SHIFT))&IEVENT_BFECR_PT0_BC_MASK)
#define IEVENT_BFECR_PT0_AC_MASK                 0xC0000000u
#define IEVENT_BFECR_PT0_AC_SHIFT                30
#define IEVENT_BFECR_PT0_AC(x)                   (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR_PT0_AC_SHIFT))&IEVENT_BFECR_PT0_AC_MASK)

/**
 * @}
 */ /* end of group IEVENT_Register_Masks */


