NXP-MCU-X-Lab/nxp_easy_mcuboot/Libraries/startup/inc/MKE15D7.h
/* RCM - Peripheral instance base addresses */
/** Peripheral RCM base address */
#define RCM_BASE                                 (0x40057000u)
/** Peripheral RCM base pointer */
#define RCM                                      ((RCM_Type *)RCM_BASE)

/**
 * @}
 */ /* end of group RCM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup RTC_Peripheral_Access_Layer RTC Peripheral Access Layer
 * @{
 */

/** RTC - Register Layout Typedef */
typedef struct {
  __IO uint32_t SC;                                /**< RTC Status and Control Register, offset: 0x0 */
  __IO uint32_t MOD;                               /**< RTC Modulo Register, offset: 0x4 */
  __I  uint32_t CNT;                               /**< RTC Counter Register, offset: 0x8 */
} RTC_Type;

/* ----------------------------------------------------------------------------
   -- RTC Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup RTC_Register_Masks RTC Register Masks
 * @{
 */

/* SC Bit Fields */
#define RTC_SC_RTCO_MASK                         0x10u
#define RTC_SC_RTCO_SHIFT                        4
#define RTC_SC_DMAE_MASK                         0x20u
#define RTC_SC_DMAE_SHIFT                        5
#define RTC_SC_RTIE_MASK                         0x40u
#define RTC_SC_RTIE_SHIFT                        6
#define RTC_SC_RTIF_MASK                         0x80u
#define RTC_SC_RTIF_SHIFT                        7
#define RTC_SC_RTCPS_MASK                        0x700u
#define RTC_SC_RTCPS_SHIFT                       8
#define RTC_SC_RTCPS(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_SC_RTCPS_SHIFT))&RTC_SC_RTCPS_MASK)
#define RTC_SC_RTCLKS_MASK                       0xC000u
#define RTC_SC_RTCLKS_SHIFT                      14
#define RTC_SC_RTCLKS(x)                         (((uint32_t)(((uint32_t)(x))<<RTC_SC_RTCLKS_SHIFT))&RTC_SC_RTCLKS_MASK)
/* MOD Bit Fields */
#define RTC_MOD_MOD_MASK                         0xFFFFu
#define RTC_MOD_MOD_SHIFT                        0
#define RTC_MOD_MOD(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_MOD_MOD_SHIFT))&RTC_MOD_MOD_MASK)
/* CNT Bit Fields */
#define RTC_CNT_CNT_MASK                         0xFFFFu
#define RTC_CNT_CNT_SHIFT                        0
#define RTC_CNT_CNT(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_CNT_CNT_SHIFT))&RTC_CNT_CNT_MASK)

/**
 * @}
 */ /* end of group RTC_Register_Masks */


/* RTC - Peripheral instance base addresses */
/** Peripheral RTC base address */
#define RTC_BASE                                 (0x4002D000u)
/** Peripheral RTC base pointer */
#define RTC                                      ((RTC_Type *)RTC_BASE)

/**
 * @}
 */ /* end of group RTC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup SIM_Peripheral_Access_Layer SIM Peripheral Access Layer
 * @{
 */

/** SIM - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t SOPT2;                             /**< System Options Register 2, offset: 0x4 */
  __IO uint32_t SOPT3;                             /**< System Options Register 3, offset: 0x8 */
  __IO uint32_t SOPT4;                             /**< System Options Register 4, offset: 0xC */
  __IO uint32_t SOPT5;                             /**< System Options Register 5, offset: 0x10 */
  __IO uint32_t SOPT6;                             /**< System Options Register 6, offset: 0x14 */
  __IO uint32_t SOPT7;                             /**< System Options Register 7, offset: 0x18 */
       uint8_t RESERVED_1[8];
  __I  uint32_t SDID;                              /**< System Device Identification Register, offset: 0x24 */
       uint8_t RESERVED_2[16];
  __IO uint32_t SCGC5;                             /**< System Clock Gating Control Register 5, offset: 0x38 */
  __IO uint32_t SCGC6;                             /**< System Clock Gating Control Register 6, offset: 0x3C */
  __IO uint32_t SCGC7;                             /**< System Clock Gating Control Register 7, offset: 0x40 */
  __IO uint32_t CLKDIV1;                           /**< System Clock Divider Register 1, offset: 0x44 */
       uint8_t RESERVED_3[12];
  __I  uint32_t UIDH;                              /**< Unique Identification Register High, offset: 0x54 */
  __I  uint32_t UIDMH;                             /**< Unique Identification Register Mid-High, offset: 0x58 */
  __I  uint32_t UIDML;                             /**< Unique Identification Register Mid Low, offset: 0x5C */
  __I  uint32_t UIDL;                              /**< Unique Identification Register Low, offset: 0x60 */
} SIM_Type;

/* ----------------------------------------------------------------------------
   -- SIM Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup SIM_Register_Masks SIM Register Masks
 * @{
 */

/* SOPT2 Bit Fields */
#define SIM_SOPT2_FLLENSTOP4_MASK                0x1u
#define SIM_SOPT2_FLLENSTOP4_SHIFT               0
#define SIM_SOPT2_RESETIFE_MASK                  0x2u
#define SIM_SOPT2_RESETIFE_SHIFT                 1
#define SIM_SOPT2_OBEPADSELA13_MASK              0x30u
#define SIM_SOPT2_OBEPADSELA13_SHIFT             4
#define SIM_SOPT2_OBEPADSELA13(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA13_SHIFT))&SIM_SOPT2_OBEPADSELA13_MASK)
#define SIM_SOPT2_OBEPADSELA12_MASK              0xC0u
#define SIM_SOPT2_OBEPADSELA12_SHIFT             6
#define SIM_SOPT2_OBEPADSELA12(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA12_SHIFT))&SIM_SOPT2_OBEPADSELA12_MASK)
#define SIM_SOPT2_OBEPADSELA3_MASK               0x300u
#define SIM_SOPT2_OBEPADSELA3_SHIFT              8
#define SIM_SOPT2_OBEPADSELA3(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA3_SHIFT))&SIM_SOPT2_OBEPADSELA3_MASK)
#define SIM_SOPT2_OBEPADSELA2_MASK               0xC00u
#define SIM_SOPT2_OBEPADSELA2_SHIFT              10
#define SIM_SOPT2_OBEPADSELA2(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA2_SHIFT))&SIM_SOPT2_OBEPADSELA2_MASK)
#define SIM_SOPT2_OBEPADSELE1_MASK               0x3000u
#define SIM_SOPT2_OBEPADSELE1_SHIFT              12
#define SIM_SOPT2_OBEPADSELE1(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELE1_SHIFT))&SIM_SOPT2_OBEPADSELE1_MASK)
#define SIM_SOPT2_OBEPADSELE0_MASK               0xC000u
#define SIM_SOPT2_OBEPADSELE0_SHIFT              14
#define SIM_SOPT2_OBEPADSELE0(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELE0_SHIFT))&SIM_SOPT2_OBEPADSELE0_MASK)
#define SIM_SOPT2_FBSL_MASK                      0x30000u
#define SIM_SOPT2_FBSL_SHIFT                     16
#define SIM_SOPT2_FBSL(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_FBSL_SHIFT))&SIM_SOPT2_FBSL_MASK)
#define SIM_SOPT2_TRACECLKSEL_MASK               0x40000u
#define SIM_SOPT2_TRACECLKSEL_SHIFT              18
#define SIM_SOPT2_RAMSIZE_MASK                   0x200000u
#define SIM_SOPT2_RAMSIZE_SHIFT                  21
#define SIM_SOPT2_FSIZE_MASK                     0xC000000u
#define SIM_SOPT2_FSIZE_SHIFT                    26
#define SIM_SOPT2_FSIZE(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_FSIZE_SHIFT))&SIM_SOPT2_FSIZE_MASK)
#define SIM_SOPT2_TSIEN_MASK                     0x10000000u
#define SIM_SOPT2_TSIEN_SHIFT                    28
#define SIM_SOPT2_MAXCLK_MASK                    0x20000000u
#define SIM_SOPT2_MAXCLK_SHIFT                   29
/* SOPT3 Bit Fields */
#define SIM_SOPT3_FTM0_PDB_MASK                  0xFu
#define SIM_SOPT3_FTM0_PDB_SHIFT                 0
#define SIM_SOPT3_FTM0_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM0_PDB_SHIFT))&SIM_SOPT3_FTM0_PDB_MASK)
#define SIM_SOPT3_FTM1_PDB_MASK                  0xF0u
#define SIM_SOPT3_FTM1_PDB_SHIFT                 4
#define SIM_SOPT3_FTM1_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM1_PDB_SHIFT))&SIM_SOPT3_FTM1_PDB_MASK)
#define SIM_SOPT3_FTM2_PDB_MASK                  0xF00u
#define SIM_SOPT3_FTM2_PDB_SHIFT                 8
#define SIM_SOPT3_FTM2_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM2_PDB_SHIFT))&SIM_SOPT3_FTM2_PDB_MASK)
#define SIM_SOPT3_FTM3_PDB_MASK                  0xF000u
#define SIM_SOPT3_FTM3_PDB_SHIFT                 12
#define SIM_SOPT3_FTM3_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM3_PDB_SHIFT))&SIM_SOPT3_FTM3_PDB_MASK)
#define SIM_SOPT3_FTM_SYNC0_MASK                 0x10000u
#define SIM_SOPT3_FTM_SYNC0_SHIFT                16
#define SIM_SOPT3_FTM_SYNC1_MASK                 0x20000u
#define SIM_SOPT3_FTM_SYNC1_SHIFT                17
#define SIM_SOPT3_FTM_SYNC2_MASK                 0x40000u
#define SIM_SOPT3_FTM_SYNC2_SHIFT                18
#define SIM_SOPT3_FTM_SYNC3_MASK                 0x80000u
#define SIM_SOPT3_FTM_SYNC3_SHIFT                19
/* SOPT4 Bit Fields */
#define SIM_SOPT4_FTM0FLT0_MASK                  0x1u
#define SIM_SOPT4_FTM0FLT0_SHIFT                 0
#define SIM_SOPT4_FTM0FLT1_MASK                  0x2u
#define SIM_SOPT4_FTM0FLT1_SHIFT                 1
#define SIM_SOPT4_FTM0FLT2_MASK                  0x4u
#define SIM_SOPT4_FTM0FLT2_SHIFT                 2
#define SIM_SOPT4_FTM0FLT3_MASK                  0x8u
#define SIM_SOPT4_FTM0FLT3_SHIFT                 3
#define SIM_SOPT4_FTM3FLT0_MASK                  0x1000u
#define SIM_SOPT4_FTM3FLT0_SHIFT                 12
#define SIM_SOPT4_FTM3FLT1_MASK                  0x2000u
#define SIM_SOPT4_FTM3FLT1_SHIFT                 13
#define SIM_SOPT4_FTM3FLT2_MASK                  0x4000u
#define SIM_SOPT4_FTM3FLT2_SHIFT                 14
#define SIM_SOPT4_FTM3FLT3_MASK                  0x8000u
#define SIM_SOPT4_FTM3FLT3_SHIFT                 15
#define SIM_SOPT4_FTM1CH0SRC_MASK                0x300000u
#define SIM_SOPT4_FTM1CH0SRC_SHIFT               20
#define SIM_SOPT4_FTM1CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1CH0SRC_SHIFT))&SIM_SOPT4_FTM1CH0SRC_MASK)
#define SIM_SOPT4_FTM2CH0SRC_MASK                0xC00000u
#define SIM_SOPT4_FTM2CH0SRC_SHIFT               22
#define SIM_SOPT4_FTM2CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2CH0SRC_SHIFT))&SIM_SOPT4_FTM2CH0SRC_MASK)
#define SIM_SOPT4_FTM0CLKSEL_MASK                0x1000000u
#define SIM_SOPT4_FTM0CLKSEL_SHIFT               24
#define SIM_SOPT4_FTM1CLKSEL_MASK                0x2000000u
#define SIM_SOPT4_FTM1CLKSEL_SHIFT               25
#define SIM_SOPT4_FTM2CLKSEL_MASK                0x4000000u
#define SIM_SOPT4_FTM2CLKSEL_SHIFT               26
#define SIM_SOPT4_FTM3CLKSEL_MASK                0x8000000u
#define SIM_SOPT4_FTM3CLKSEL_SHIFT               27
/* SOPT5 Bit Fields */
#define SIM_SOPT5_UART0TXSRC_MASK                0x3u
#define SIM_SOPT5_UART0TXSRC_SHIFT               0
#define SIM_SOPT5_UART0TXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0TXSRC_SHIFT))&SIM_SOPT5_UART0TXSRC_MASK)
#define SIM_SOPT5_UART0RXSRC_MASK                0xCu
#define SIM_SOPT5_UART0RXSRC_SHIFT               2
#define SIM_SOPT5_UART0RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0RXSRC_SHIFT))&SIM_SOPT5_UART0RXSRC_MASK)
#define SIM_SOPT5_UART1TXSRC_MASK                0x30u
#define SIM_SOPT5_UART1TXSRC_SHIFT               4
#define SIM_SOPT5_UART1TXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1TXSRC_SHIFT))&SIM_SOPT5_UART1TXSRC_MASK)
#define SIM_SOPT5_UART1RXSRC_MASK                0xC0u
#define SIM_SOPT5_UART1RXSRC_SHIFT               6
#define SIM_SOPT5_UART1RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1RXSRC_SHIFT))&SIM_SOPT5_UART1RXSRC_MASK)
/* SOPT6 Bit Fields */
#define SIM_SOPT6_CLKDIV_MASK                    0x7u
#define SIM_SOPT6_CLKDIV_SHIFT                   0
#define SIM_SOPT6_CLKDIV(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_CLKDIV_SHIFT))&SIM_SOPT6_CLKDIV_MASK)
#define SIM_SOPT6_CLKOS_MASK                     0xF0u
#define SIM_SOPT6_CLKOS_SHIFT                    4
#define SIM_SOPT6_CLKOS(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_CLKOS_SHIFT))&SIM_SOPT6_CLKOS_MASK)
/* SOPT7 Bit Fields */
#define SIM_SOPT7_ADC0TRGSEL_MASK                0xFu
#define SIM_SOPT7_ADC0TRGSEL_SHIFT               0
#define SIM_SOPT7_ADC0TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC0TRGSEL_SHIFT))&SIM_SOPT7_ADC0TRGSEL_MASK)
#define SIM_SOPT7_ADC1TRGSEL_MASK                0xF0u
#define SIM_SOPT7_ADC1TRGSEL_SHIFT               4
#define SIM_SOPT7_ADC1TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC1TRGSEL_SHIFT))&SIM_SOPT7_ADC1TRGSEL_MASK)
#define SIM_SOPT7_ADC2TRGSEL_MASK                0xF00u
#define SIM_SOPT7_ADC2TRGSEL_SHIFT               8
#define SIM_SOPT7_ADC2TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC2TRGSEL_SHIFT))&SIM_SOPT7_ADC2TRGSEL_MASK)
#define SIM_SOPT7_ADC3TRGSEL_MASK                0xF000u
#define SIM_SOPT7_ADC3TRGSEL_SHIFT               12
#define SIM_SOPT7_ADC3TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC3TRGSEL_SHIFT))&SIM_SOPT7_ADC3TRGSEL_MASK)
#define SIM_SOPT7_CMP0WS_MASK                    0x30000u
#define SIM_SOPT7_CMP0WS_SHIFT                   16
#define SIM_SOPT7_CMP0WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP0WS_SHIFT))&SIM_SOPT7_CMP0WS_MASK)
#define SIM_SOPT7_CMP1WS_MASK                    0xC0000u
#define SIM_SOPT7_CMP1WS_SHIFT                   18
#define SIM_SOPT7_CMP1WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP1WS_SHIFT))&SIM_SOPT7_CMP1WS_MASK)
#define SIM_SOPT7_CMP2WS_MASK                    0x300000u
#define SIM_SOPT7_CMP2WS_SHIFT                   20
#define SIM_SOPT7_CMP2WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP2WS_SHIFT))&SIM_SOPT7_CMP2WS_MASK)
#define SIM_SOPT7_CMP3WS_MASK                    0xC00000u
#define SIM_SOPT7_CMP3WS_SHIFT                   22
#define SIM_SOPT7_CMP3WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP3WS_SHIFT))&SIM_SOPT7_CMP3WS_MASK)
#define SIM_SOPT7_ADC0ALTTRGEN_MASK              0x10000000u
#define SIM_SOPT7_ADC0ALTTRGEN_SHIFT             28
#define SIM_SOPT7_ADC1ALTTRGEN_MASK              0x20000000u
#define SIM_SOPT7_ADC1ALTTRGEN_SHIFT             29
#define SIM_SOPT7_ADC2ALTTRGEN_MASK              0x40000000u
#define SIM_SOPT7_ADC2ALTTRGEN_SHIFT             30
#define SIM_SOPT7_ADC3ALTTRGEN_MASK              0x80000000u
#define SIM_SOPT7_ADC3ALTTRGEN_SHIFT             31
/* SDID Bit Fields */
#define SIM_SDID_BOID_MASK                       0xFu
#define SIM_SDID_BOID_SHIFT                      0
#define SIM_SDID_BOID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SDID_BOID_SHIFT))&SIM_SDID_BOID_MASK)
#define SIM_SDID_DIEID_MASK                      0x30u
#define SIM_SDID_DIEID_SHIFT                     4
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_DIEID_SHIFT))&SIM_SDID_DIEID_MASK)
#define SIM_SDID_REVID_MASK                      0xF000u
#define SIM_SDID_REVID_SHIFT                     12
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_REVID_SHIFT))&SIM_SDID_REVID_MASK)
/* SCGC5 Bit Fields */
#define SIM_SCGC5_EWM_MASK                       0x2u
#define SIM_SCGC5_EWM_SHIFT                      1
#define SIM_SCGC5_CMT_MASK                       0x4u
#define SIM_SCGC5_CMT_SHIFT                      2
#define SIM_SCGC5_IIC0_MASK                      0x80u
#define SIM_SCGC5_IIC0_SHIFT                     7
#define SIM_SCGC5_IIC1_MASK                      0x100u
#define SIM_SCGC5_IIC1_SHIFT                     8
#define SIM_SCGC5_UART0_MASK                     0x200u
#define SIM_SCGC5_UART0_SHIFT                    9
#define SIM_SCGC5_UART1_MASK                     0x400u
#define SIM_SCGC5_UART1_SHIFT                    10
#define SIM_SCGC5_UART2_MASK                     0x800u
#define SIM_SCGC5_UART2_SHIFT                    11
#define SIM_SCGC5_UART3_MASK                     0x1000u
#define SIM_SCGC5_UART3_SHIFT                    12
#define SIM_SCGC5_SPI0_MASK                      0x4000u
#define SIM_SCGC5_SPI0_SHIFT                     14
#define SIM_SCGC5_SPI1_MASK                      0x8000u
#define SIM_SCGC5_SPI1_SHIFT                     15
#define SIM_SCGC5_ACMP0_MASK                     0x10000u
#define SIM_SCGC5_ACMP0_SHIFT                    16
#define SIM_SCGC5_ACMP1_MASK                     0x20000u
#define SIM_SCGC5_ACMP1_SHIFT                    17
#define SIM_SCGC5_ACMP2_MASK                     0x40000u
#define SIM_SCGC5_ACMP2_SHIFT                    18
#define SIM_SCGC5_ACMP3_MASK                     0x80000u
#define SIM_SCGC5_ACMP3_SHIFT                    19
/* SCGC6 Bit Fields */
#define SIM_SCGC6_DMAMUX_MASK                    0x2u
#define SIM_SCGC6_DMAMUX_SHIFT                   1
#define SIM_SCGC6_PIT_MASK                       0x8u
#define SIM_SCGC6_PIT_SHIFT                      3
#define SIM_SCGC6_CRC_MASK                       0x10u
#define SIM_SCGC6_CRC_SHIFT                      4
#define SIM_SCGC6_PDB0_MASK                      0x20u
#define SIM_SCGC6_PDB0_SHIFT                     5
#define SIM_SCGC6_PDB1_MASK                      0x40u
#define SIM_SCGC6_PDB1_SHIFT                     6
#define SIM_SCGC6_PDB2_MASK                      0x80u
#define SIM_SCGC6_PDB2_SHIFT                     7
#define SIM_SCGC6_PDB3_MASK                      0x100u
#define SIM_SCGC6_PDB3_SHIFT                     8
#define SIM_SCGC6_FTM0_MASK                      0x200u
#define SIM_SCGC6_FTM0_SHIFT                     9
#define SIM_SCGC6_FTM1_MASK                      0x400u
#define SIM_SCGC6_FTM1_SHIFT                     10
#define SIM_SCGC6_FTM2_MASK                      0x800u
#define SIM_SCGC6_FTM2_SHIFT                     11
#define SIM_SCGC6_FTM3_MASK                      0x1000u
#define SIM_SCGC6_FTM3_SHIFT                     12
#define SIM_SCGC6_RTC_MASK                       0x2000u
#define SIM_SCGC6_RTC_SHIFT                      13
#define SIM_SCGC6_TSI_MASK                       0x10000u
#define SIM_SCGC6_TSI_SHIFT                      16
#define SIM_SCGC6_PORTA_MASK                     0x80000u
#define SIM_SCGC6_PORTA_SHIFT                    19
#define SIM_SCGC6_PORTB_MASK                     0x100000u
#define SIM_SCGC6_PORTB_SHIFT                    20
#define SIM_SCGC6_PORTC_MASK                     0x200000u
#define SIM_SCGC6_PORTC_SHIFT                    21
#define SIM_SCGC6_PORTD_MASK                     0x400000u
#define SIM_SCGC6_PORTD_SHIFT                    22
#define SIM_SCGC6_PORTE_MASK                     0x800000u
#define SIM_SCGC6_PORTE_SHIFT                    23
#define SIM_SCGC6_ADC0_MASK                      0x8000000u
#define SIM_SCGC6_ADC0_SHIFT                     27
#define SIM_SCGC6_ADC1_MASK                      0x10000000u
#define SIM_SCGC6_ADC1_SHIFT                     28
#define SIM_SCGC6_ADC2_MASK                      0x20000000u
#define SIM_SCGC6_ADC2_SHIFT                     29
#define SIM_SCGC6_ADC3_MASK                      0x40000000u
#define SIM_SCGC6_ADC3_SHIFT                     30
/* SCGC7 Bit Fields */
#define SIM_SCGC7_FLEXBUS_MASK                   0x1u
#define SIM_SCGC7_FLEXBUS_SHIFT                  0
#define SIM_SCGC7_DMA_MASK                       0x2u
#define SIM_SCGC7_DMA_SHIFT                      1
#define SIM_SCGC7_MPU_MASK                       0x4u
#define SIM_SCGC7_MPU_SHIFT                      2
#define SIM_SCGC7_IEVT_MASK                      0x8u
#define SIM_SCGC7_IEVT_SHIFT                     3
/* CLKDIV1 Bit Fields */
#define SIM_CLKDIV1_OUTDIV5_MASK                 0x3000u
#define SIM_CLKDIV1_OUTDIV5_SHIFT                12
#define SIM_CLKDIV1_OUTDIV5(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV5_SHIFT))&SIM_CLKDIV1_OUTDIV5_MASK)
#define SIM_CLKDIV1_OUTDIV4_MASK                 0x30000u
#define SIM_CLKDIV1_OUTDIV4_SHIFT                16
#define SIM_CLKDIV1_OUTDIV4(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV4_SHIFT))&SIM_CLKDIV1_OUTDIV4_MASK)
#define SIM_CLKDIV1_OUTDIV3_MASK                 0x300000u
#define SIM_CLKDIV1_OUTDIV3_SHIFT                20
#define SIM_CLKDIV1_OUTDIV3(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV3_SHIFT))&SIM_CLKDIV1_OUTDIV3_MASK)
#define SIM_CLKDIV1_OUTDIV2_MASK                 0x3000000u
#define SIM_CLKDIV1_OUTDIV2_SHIFT                24
#define SIM_CLKDIV1_OUTDIV2(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV2_SHIFT))&SIM_CLKDIV1_OUTDIV2_MASK)
#define SIM_CLKDIV1_OUTDIV1_MASK                 0x30000000u
#define SIM_CLKDIV1_OUTDIV1_SHIFT                28
#define SIM_CLKDIV1_OUTDIV1(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV1_SHIFT))&SIM_CLKDIV1_OUTDIV1_MASK)
/* UIDH Bit Fields */
#define SIM_UIDH_UID_MASK                        0xFFFFFFFFu
#define SIM_UIDH_UID_SHIFT                       0
#define SIM_UIDH_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDH_UID_SHIFT))&SIM_UIDH_UID_MASK)
/* UIDMH Bit Fields */
#define SIM_UIDMH_UID_MASK                       0xFFFFFFFFu
#define SIM_UIDMH_UID_SHIFT                      0
#define SIM_UIDMH_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDMH_UID_SHIFT))&SIM_UIDMH_UID_MASK)
/* UIDML Bit Fields */
#define SIM_UIDML_UID_MASK                       0xFFFFFFFFu
#define SIM_UIDML_UID_SHIFT                      0
#define SIM_UIDML_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDML_UID_SHIFT))&SIM_UIDML_UID_MASK)
/* UIDL Bit Fields */
#define SIM_UIDL_UID_MASK                        0xFFFFFFFFu
#define SIM_UIDL_UID_SHIFT                       0
#define SIM_UIDL_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDL_UID_SHIFT))&SIM_UIDL_UID_MASK)

/**
 * @}
 */ /* end of group SIM_Register_Masks */


/* SIM - Peripheral instance base addresses */
/** Peripheral SIM base address */
#define SIM_BASE                                 (0x40032000u)
/** Peripheral SIM base pointer */
#define SIM                                      ((SIM_Type *)SIM_BASE)

/**
 * @}
 */ /* end of group SIM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup SMC_Peripheral_Access_Layer SMC Peripheral Access Layer
 * @{
 */

/** SMC - Register Layout Typedef */
typedef struct {
  __IO uint8_t PMPROT;                             /**< SMC Power Mode Protection Register, offset: 0x0 */
  __IO uint8_t PMCTRL;                             /**< SMC Power Mode Control Register, offset: 0x1 */
       uint8_t RESERVED_0[1];
  __I  uint8_t PMSTAT;                             /**< SMC Power Mode Status Register, offset: 0x3 */
} SMC_Type;

/* ----------------------------------------------------------------------------
   -- SMC Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup SMC_Register_Masks SMC Register Masks
 * @{
 */

